ab_test_results.txt
---------------------------------------------------------
1. Отдача статического документа напрямую через gunicorn
---------------------------------------------------------
    roflanpotsan@Fedors-MacBook-Pro nginx % ab -c 10 -n 10000 http://127.0.0.1:8000/static/img/settings.png
    This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
    Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
    Licensed to The Apache Software Foundation, http://www.apache.org/

    Benchmarking 127.0.0.1 (be patient)
    Completed 1000 requests
    Completed 2000 requests
    Completed 3000 requests
    Completed 4000 requests
    Completed 5000 requests
    Completed 6000 requests
    Completed 7000 requests
    Completed 8000 requests
    Completed 9000 requests
    Completed 10000 requests
    Finished 10000 requests


    Server Software:        gunicorn
    Server Hostname:        127.0.0.1
    Server Port:            8000

    Document Path:          /static/img/settings.png
    Document Length:        6995 bytes

    Concurrency Level:      10
    Time taken for tests:   10.423 seconds
    Complete requests:      10000
    Failed requests:        0
    Total transferred:      73620000 bytes
    HTML transferred:       69950000 bytes
    Requests per second:    959.42 [#/sec] (mean)
    Time per request:       10.423 [ms] (mean)
    Time per request:       1.042 [ms] (mean, across all concurrent requests)
    Transfer rate:          6897.72 [Kbytes/sec] received

    Connection Times (ms)
                  min  mean[+/-sd] median   max
    Connect:        0    1  67.1      0    6711
    Processing:     1    4   5.5      3     182
    Waiting:        1    3   5.2      3     181
    Total:          2    4  67.4      3    6717

    Percentage of the requests served within a certain time (ms)
      50%      3
      66%      4
      75%      4
      80%      4
      90%      4
      95%      4
      98%      4
      99%      6
     100%   6717 (longest request)
---------------------------------------------------------
2. Отдача статического документа напрямую через nginx (включено кэширование статики)
---------------------------------------------------------
    roflanpotsan@Fedors-MacBook-Pro nginx % ab -c 10 -n 10000 http://127.0.0.1:80/static/img/settings.png
    This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
    Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
    Licensed to The Apache Software Foundation, http://www.apache.org/

    Benchmarking 127.0.0.1 (be patient)
    Completed 1000 requests
    Completed 2000 requests
    Completed 3000 requests
    Completed 4000 requests
    Completed 5000 requests
    Completed 6000 requests
    Completed 7000 requests
    Completed 8000 requests
    Completed 9000 requests
    Completed 10000 requests
    Finished 10000 requests


    Server Software:        nginx/1.25.3
    Server Hostname:        127.0.0.1
    Server Port:            80

    Document Path:          /static/img/settings.png
    Document Length:        6995 bytes

    Concurrency Level:      10
    Time taken for tests:   0.300 seconds
    Complete requests:      10000
    Failed requests:        0
    Total transferred:      73410000 bytes
    HTML transferred:       69950000 bytes
    Requests per second:    33296.15 [#/sec] (mean)
    Time per request:       0.300 [ms] (mean)
    Time per request:       0.030 [ms] (mean, across all concurrent requests)
    Transfer rate:          238698.30 [Kbytes/sec] received

    Connection Times (ms)
                  min  mean[+/-sd] median   max
    Connect:        0    0   0.1      0       1
    Processing:     0    0   0.1      0       3
    Waiting:        0    0   0.1      0       3
    Total:          0    0   0.2      0       3

    Percentage of the requests served within a certain time (ms)
      50%      0
      66%      0
      75%      0
      80%      0
      90%      0
      95%      1
      98%      1
      99%      1
     100%      3 (longest request)
---------------------------------------------------------
3. Отдача динамического документа напрямую через gunicorn
---------------------------------------------------------
    roflanpotsan@Fedors-MacBook-Pro nginx % ab -c 10 -n 10000 http://127.0.0.1:8000/
    This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
    Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
    Licensed to The Apache Software Foundation, http://www.apache.org/

    Benchmarking 127.0.0.1 (be patient)
    Completed 1000 requests
    Completed 2000 requests
    Completed 3000 requests
    Completed 4000 requests
    Completed 5000 requests
    Completed 6000 requests
    Completed 7000 requests
    Completed 8000 requests
    Completed 9000 requests
    Completed 10000 requests
    Finished 10000 requests


    Server Software:        gunicorn
    Server Hostname:        127.0.0.1
    Server Port:            8000

    Document Path:          /
    Document Length:        52249 bytes

    Concurrency Level:      10
    Time taken for tests:   311.067 seconds
    Complete requests:      10000
    Failed requests:        0
    Total transferred:      525460000 bytes
    HTML transferred:       522490000 bytes
    Requests per second:    32.15 [#/sec] (mean)
    Time per request:       311.067 [ms] (mean)
    Time per request:       31.107 [ms] (mean, across all concurrent requests)
    Transfer rate:          1649.63 [Kbytes/sec] received

    Connection Times (ms)
                  min  mean[+/-sd] median   max
    Connect:        0    0   0.0      0       2
    Processing:   120  311   6.2    310     393
    Waiting:      119  309   6.2    309     392
    Total:        120  311   6.2    310     393

    Percentage of the requests served within a certain time (ms)
      50%    310
      66%    312
      75%    314
      80%    315
      90%    317
      95%    319
      98%    323
      99%    325
     100%    393 (longest request)
---------------------------------------------------------
3. Отдача динамического документа через проксирование запроса с nginx на gunicorn
---------------------------------------------------------
    roflanpotsan@Fedors-MacBook-Pro nginx % ab -c 10 -n 10000 http://127.0.0.1:80/
    This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
    Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
    Licensed to The Apache Software Foundation, http://www.apache.org/

    Benchmarking 127.0.0.1 (be patient)
    Completed 1000 requests
    Completed 2000 requests
    Completed 3000 requests
    Completed 4000 requests
    Completed 5000 requests
    Completed 6000 requests
    Completed 7000 requests
    Completed 8000 requests
    Completed 9000 requests
    Completed 10000 requests
    Finished 10000 requests


    Server Software:        nginx/1.25.3
    Server Hostname:        127.0.0.1
    Server Port:            80

    Document Path:          /
    Document Length:        52249 bytes

    Concurrency Level:      10
    Time taken for tests:   315.274 seconds
    Complete requests:      10000
    Failed requests:        0
    Total transferred:      525890000 bytes
    HTML transferred:       522490000 bytes
    Requests per second:    31.72 [#/sec] (mean)
    Time per request:       315.274 [ms] (mean)
    Time per request:       31.527 [ms] (mean, across all concurrent requests)
    Transfer rate:          1628.95 [Kbytes/sec] received

    Connection Times (ms)
                  min  mean[+/-sd] median   max
    Connect:        0    0   0.0      0       1
    Processing:   215  315   9.1    313     629
    Waiting:      214  315   9.1    313     629
    Total:        216  315   9.1    313     629

    Percentage of the requests served within a certain time (ms)
      50%    313
      66%    317
      75%    319
      80%    320
      90%    323
      95%    326
      98%    329
      99%    331
     100%    629 (longest request)
---------------------------------------------------------
4. Отдача динамического документа через проксирование запроса с nginx на gunicorn,
при кэшировнии ответа на nginx (proxy cache)
---------------------------------------------------------
    roflanpotsan@Fedors-MacBook-Pro nginx % ab -c 10 -n 10000 http://127.0.0.1:80/
    This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
    Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
    Licensed to The Apache Software Foundation, http://www.apache.org/

    Benchmarking 127.0.0.1 (be patient)
    Completed 1000 requests
    Completed 2000 requests
    Completed 3000 requests
    Completed 4000 requests
    Completed 5000 requests
    Completed 6000 requests
    Completed 7000 requests
    Completed 8000 requests
    Completed 9000 requests
    Completed 10000 requests
    Finished 10000 requests


    Server Software:        nginx/1.25.3
    Server Hostname:        127.0.0.1
    Server Port:            80

    Document Path:          /
    Document Length:        52249 bytes

    Concurrency Level:      10
    Time taken for tests:   3.009 seconds
    Complete requests:      10000
    Failed requests:        0
    Total transferred:      525890000 bytes
    HTML transferred:       522490000 bytes
    Requests per second:    9909.05 [#/sec] (mean)
    Time per request:       1.009 [ms] (mean)
    Time per request:       0.101 [ms] (mean, across all concurrent requests)
    Transfer rate:          508893.83 [Kbytes/sec] received

    Connection Times (ms)
                  min  mean[+/-sd] median   max
    Connect:        0    0   0.0      0       1
    Processing:     0    1  13.7      0     557
    Waiting:        0    1  13.6      0     557
    Total:          0    1  13.7      0     558

    Percentage of the requests served within a certain time (ms)
      50%      0
      66%      0
      75%      0
      80%      0
      90%      0
      95%      1
      98%      1
      99%      1
     100%    558 (longest request)
---------------------------------------------------------
Time taken for tests:   311.067 seconds / Time taken for tests:   10.423 seconds ~ 30
Таким образом, статический документ отдается в ~30 раз быстрее, чем динамический (напрямую через gunicorn).
Time taken for tests:   10.423 seconds / Time taken for tests:   0.300 seconds ~ 35
При кэшировании статики через nginx можно ускорить время отдачи статики еще в ~35 раз.
При этом, при проксировании динамического документа время немного увеличивается,
т.к. запрос проходит дополнительно через nginx.
Но nginx имеет директиву proxy_cache, которая позволяет значительно ускорить время обработки запросов.
Time taken for tests:   315.274 seconds / Time taken for tests:   3.009 seconds ~ 100